In [12]:
import pandas as pd

df = pd.read_csv('example.csv', header=None) 
df

     0        1    2        3
0  NaN     name  age     city
1  0.0    Alice   25    Seoul
2  1.0      Bob   30    Busan
3  2.0  Charlie   35    Daegu
4  3.0   Dongsu  NaN    Daegu
5  4.0     Suji   20  Daejeon
6  5.0     John   35      NaN

In [22]:
df = pd.read_csv('example.csv', index_col = 0)
df.head()

      name   age     city
0    Alice  25.0    Seoul
1      Bob  30.0    Busan
2  Charlie  35.0    Daegu
3   Dongsu   NaN    Daegu
4     Suji  20.0  Daejeon

In [28]:
df.describe()   #수치형 데이터에 관해서 설명해줄 수 있음
                #count 데이터의 개수가 몇개다 결측지 값을 제외
                #mean 평균값을 알려줌

             age
count   5.000000
mean   29.000000
std     6.519202
min    20.000000
25%    25.000000
50%    30.000000
75%    35.000000
max    35.000000

In [25]:
df.tail(3) #끝에서부터 데이터를 불러오는거

     name   age     city
3  Dongsu   NaN    Daegu
4    Suji  20.0  Daejeon
5    John  35.0      NaN

In [27]:
df.info() #데이터에 대한 정보를 알려주는

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   city    5 non-null      object
dtypes: float64(1), object(2)
memory usage: 192.0+ bytes

In [31]:
#결측치를 확인 하는 방법 1.
df.isnull().sum()

name    0
age     1
city    1
dtype: int64

In [30]:
#결측치를 확인 하는 방법 2.
df.isna()

    name    age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False  False
5  False  False   True

In [33]:
df['age'].isnull() #열 하나만 골라서 null인지 아닌지 확인하는 방법

df[df['age'].isnull()] #age column을 훑어보다가 age가 null인 값의 row(행)을 모두 가져오는 방법

     name  age   city
3  Dongsu  NaN  Daegu

In [24]:
import pandas as pd #pandas를 pd라는 별칭으로 
pd.__version__

'2.2.3'

In [12]:
pd.Series(['banana', 'apple', 'orange']) #1차원적인 구조에서 Series라고 부름

0    banana
1     apple
2    orange
dtype: object

In [24]:
pd.Series(['banana', 'apple', 'orange'], index=['a', 'b', 'c'])

a    banana
b     apple
c    orange
dtype: object

In [9]:
#dictionary형태
df = pd.DataFrame({        
            'name': ['Alice', 'Bob', 'Charile'], 
            'age': [25, 30, 35],
            'city': ['Seoul', 'Busan', 'Daegu'],
})
df

      name  age   city
0    Alice   25  Seoul
1      Bob   30  Busan
2  Charile   35  Daegu

In [38]:
#열(column) 접근하는 방법!
df[['age', 'name', 'city']]

   age     name   city
0   25    Alice  Seoul
1   30      Bob  Busan
2   35  Charile  Daegu

In [21]:
#행(row)로 접근하는 방법 1.
#df.loc[1, 'city'] #출력 'Busan'

#행(row)로 접근하는 방법 2. 
df.iloc[0:3,2]

0    Seoul
1    Busan
2    Daegu
Name: city, dtype: object

In [ ]:
#Week3 2nd Class

In [2]:
import pandas as pd
pd.__version__

'2.2.3'

In [12]:
df = pd.read_csv("data/example.csv", index_col=0)
df

      name   age     city
0    Alice  25.0    Seoul
1      Bob  30.0    Busan
2  Charlie  35.0    Daegu
3   Dongsu   NaN    Daegu
4     Suji  20.0  Daejeon
5     John  35.0      NaN

In [16]:
#결측치 제거(열을 제거, 행을 제거)
#dropna(): 결측치가 포함된 행 전체를 제거
#DataFRame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) inplace = True로 설정하면 결측치를 제외한 값들을 업데이트해서 반환
df.dropna(axis=1) #1열 반환

      name
0    Alice
1      Bob
2  Charlie
3   Dongsu
4     Suji
5     John

In [22]:
#df.fillna(value=None, axis=None, inplace=False, limit=None)
#value는 결측치를 대체할 값, axis는 결측치를 대체할 방향을 지정(0:행, 1:열), limit 한번에 대체할 결측치의 개수를 지정

df['age'] = df['age'].fillna(df['age'].mean())
df

      name   age     city
0    Alice  25.0    Seoul
1      Bob  30.0    Busan
2  Charlie  35.0    Daegu
3   Dongsu  29.0    Daegu
4     Suji  20.0  Daejeon
5     John  35.0      NaN

In [27]:
#결측치 대체
#ffill(): 이전 값으로 결측치 채움
#bfill(): 이후 값으로 결측치 채움

df = df.ffill()
df #결측치의 이전 값인 Daejeon으로 값 설정.

      name   age     city
0    Alice  25.0    Seoul
1      Bob  30.0    Busan
2  Charlie  35.0    Daegu
3   Dongsu  29.0    Daegu
4     Suji  20.0  Daejeon
5     John  35.0  Daejeon

In [29]:
df.dtypes['age'] #해당 열의 dataType을 확인할 수 있는

dtype('float64')

In [30]:
#astype(dtype, copy=True, error='raise') error = ignore이면 에러 무시 error = raise(기본값)이면  변활할 수 없는 값이 
df['age'].astype(int) #df의 age열의 type을 int로 변환

0    25
1    30
2    35
3    29
4    20
5    35
Name: age, dtype: int64

In [33]:
#열 이름 변경 rename()
#DataFrame.rename(index=None, column=None, axis=None, copy=True, inplace=False, level=None, error='ignore')

In [36]:
#데이터 정렬
df.sort_values(by='age', ascending=True, inplace=True)
df

      name   age     city
4     Suji  20.0  Daejeon
0    Alice  25.0    Seoul
3   Dongsu  29.0    Daegu
1      Bob  30.0    Busan
2  Charlie  35.0    Daegu
5     John  35.0  Daejeon

In [41]:
import pandas as pd #pandas를 pd라는 별칭으로 

df = pd.read_csv('data/student_admission_record_dirty.csv')
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
0,Shehroz,24.0,Female,50.0,68.90,Quetta,Rejected
1,Waqar,21.0,Female,99.0,60.73,Karachi,NaN
2,Bushra,17.0,Male,89.0,NaN,Islamabad,Accepted
3,Aliya,17.0,Male,55.0,85.29,Karachi,Rejected
4,Bilal,20.0,Male,65.0,61.13,Lahore,NaN
...,...,...,...,...,...,...,...
152,Ali,19.0,Female,85.0,78.09,Quetta,Accepted
153,Bilal,17.0,Female,81.0,84.40,Islamabad,Rejected
154,Fatima,21.0,Female,98.0,50.86,Multan,Accepted
155,Shoaib,-1.0,Male,91.0,80.12,Quetta,Accepted
156,Maaz,17.0,Male,88.0,86.85,Lahore,Accepted

In [44]:
df = df.sort_values(by='Age')
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
23,Aliya,-1.0,Male,101.0,54.59,NaN,NaN
50,Shehroz,-1.0,Female,61.0,69.48,Quetta,Rejected
113,Zunaira,-1.0,Female,84.0,58.77,Quetta,Rejected
89,NaN,-1.0,Male,66.0,79.07,Rawalpindi,Rejected
155,Shoaib,-1.0,Male,91.0,80.12,Quetta,Accepted
...,...,...,...,...,...,...,...
87,Laiba,NaN,Female,81.0,81.82,Rawalpindi,Accepted
124,Hania,NaN,Female,83.0,71.78,Islamabad,Accepted
135,Hafsa,NaN,Male,55.0,97.46,Quetta,Rejected
136,Asad,NaN,Female,82.0,67.42,Lahore,Accepted
150,Nashit,NaN,Male,89.0,84.64,Lahore,Accepted

In [45]:
#중복 데이터 처리 drop_duplicates(subset=None, keep='first', inplace=False)
df = df.drop_duplicates(subset='Age')
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
23,Aliya,-1.0,Male,101.0,54.59,NaN,NaN
28,Bushra,17.0,Male,89.0,78.57,Islamabad,Accepted
6,Asad,18.0,Male,NaN,97.31,Multan,Accepted
129,Aliya,19.0,Male,79.0,91.85,Islamabad,Rejected
51,Fatima,20.0,Male,73.0,62.50,Karachi,NaN
72,NaN,21.0,Male,95.0,84.20,Islamabad,NaN
41,Feroze,22.0,Female,50.0,88.36,Quetta,Rejected
121,Muneera,23.0,Male,77.0,57.93,Karachi,Rejected
120,Ayesha,24.0,Male,94.0,98.43,Multan,Rejected
16,Mahnoor,NaN,Male,61.0,74.08,Islamabad,Rejected

In [49]:
#이상치 처리
df = df[df['Age'] > 0]
df

,Name,Age,Gender,Admission Test Score,High School Percentage,City,Admission Status
28,Bushra,17.0,Male,89.0,78.57,Islamabad,Accepted
6,Asad,18.0,Male,NaN,97.31,Multan,Accepted
129,Aliya,19.0,Male,79.0,91.85,Islamabad,Rejected
51,Fatima,20.0,Male,73.0,62.50,Karachi,NaN
72,NaN,21.0,Male,95.0,84.20,Islamabad,NaN
41,Feroze,22.0,Female,50.0,88.36,Quetta,Rejected
121,Muneera,23.0,Male,77.0,57.93,Karachi,Rejected
120,Ayesha,24.0,Male,94.0,98.43,Multan,Rejected

In [52]:
#문자열 데이터 정제
#str.strip(): 문자열의 양쪽 끝에 있는 불필요한 공백 제거
#str.replace(): 문자열 내 특정 부분을 다른 문자열로 대체
#str.upper(): 문자열을 대문자로 변환
#str.lower(): 문자열을 소문자로 변환

df['Name'].str.lower()

28      bushra
6         asad
129      aliya
51      fatima
72         NaN
41      feroze
121    muneera
120     ayesha
Name: Name, dtype: object

In [5]:
#concat()
#obj: 연결할 데이터프레임, 리스트 또는 dictoniary 형태로
#
import pandas as pd
df1 = pd.DataFrame({"id":[1,2,3], "name":["Alice", "Bob", "Charlie"]})
df2 = pd.DataFrame({"id":[2,3,4], "score":[85,90,95]})
print(df1, df2)

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie    id  score
0   2     85
1   3     90
2   4     95

In [9]:
pd.merge(df1, df2, on="id", how="outer")

   id     name  score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   95.0